nyankowan/CatchRobo_2026/STM32/robomas_controller/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "arm.h"
#include "can_protocol.h"
#include "coordinate.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_can.h"
#include "stm32f4xx_hal_gpio.h"
#include "stm_can.h"
#include <math.h>
#include <stdint.h>
#include <string.h>
#include <stdbool.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef struct
{
    uint16_t angle_raw;

    int32_t total_angle;

    int16_t rpm;
    int16_t current;
    uint8_t temperature;

    uint16_t last_angle; //to calc total_angle

    uint32_t last_update; // 最後に受信した時間 HAL_GetTick()

    bool initialized; //初回ロボマスフィードバックを受けたか
} robomas_feedback_t;

/**
* @param double p;   比例ゲイン 
* @param double i;   積分ゲイン
* @param double d;   微分ゲイン
* @param double mv;  manipulated value 操作量
* @param double sv;  set value 目標値
* @param double it;  integral term 積分項 偏差の総和
* @param double pe;  previous error 直前の偏差
* @param double pv;  process value 制御量 フィードバック
* @param uint32_t last_update;   最後に更新した時間 HAL_GetTick()
**/
typedef struct{
  double p;   //比例ゲイン
  double i;   //積分ゲイン
  double d;   //微分ゲイン
  double mv;  //manipulated value 操作量
  double sv;  //set value 目標値
  double it;  //integral term 積分項 偏差の総和
  double pe;  //previous error 直前の偏差
  double pv;  //process value 制御量 フィードバック
  uint32_t last_update;  // 最後に更新した時間 HAL_GetTick()
}pid_t;

/**
* @param ROBOMAS_HOMING, // 速度制御によって，リミットスイッチ位置まで回転する
* @param ROBOMAS_IDLE,   // ホーミング終了による他のホーミングを待機
* @param ROBOMAS_READY,  // ユーザが制御可能な状態
 */
typedef enum{
  ROBOMAS_INITIAL,  // 初回起動時状態
  ROBOMAS_HOMING,   // 速度制御によって，リミットスイッチ位置まで回転する
  ROBOMAS_IDLE,     // ホーミング終了による他のホーミングを待機
  ROBOMAS_READY,    // ユーザが制御可能な状態
  ROBOMAS_ERROR,    // 制御不能状態
}robomas_state_t;

typedef struct{
  robomas_feedback_t feedback;
  pid_t rpm_pid;  //モーターrpmの制御
  pid_t ang_pid;  //モーター角(resolution 8192)の制御
  robomas_state_t state;
  int32_t total_angle_home;//極座標の原点に対応するモーター角(一周あたりの解像度 8192)
  int16_t tx_torque;

}robomas_t;

uint32_t upper_homing_start_time;
uint32_t lower_homing_start_time;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define LOOP_MS 2
#define ROBOMAS_FEEDBACK_TIMEOUT_MS 100

#define ROBOMAS_NUM 4

#define ROBOMAS_MAX_TORQUE 16384 //ロボマスに送れる最大電流値

#define ARM_DEG_ROBOMAS_DIRECTION 1 //上から見て半時計回りが正でモーターは右ねじを正とするとき
#define ARM_R_ROBOMAS_DIRECTION -1 //アームが伸びる方向が正でモーター右ねじ正


//ToDo: pullupしているので，導通したらRESET，していないならSETになる．リミットスイッチの接続によって変える．
//      リミットスイッチ：COM NO NC の三つのコネクタがあり，COMは常に接続されている．NOはスイッチを押すと導通，NCはスイッチを離すと導通．
#define LOWER_ARM_DEG_UNDER_LIMIT_ON (HAL_GPIO_ReadPin(LOWER_ARM_DEG_UNDER_LIMIT_GPIO_Port, LOWER_ARM_DEG_UNDER_LIMIT_Pin) == GPIO_PIN_RESET)
#define LOWER_ARM_DEG_UNDER_LIMIT_OFF !LOWER_ARM_DEG_UNDER_LIMIT_ON

#define LOWER_ARM_R_LIMIT_ON (HAL_GPIO_ReadPin(LOWER_ARM_R_LIMIT_GPIO_Port, LOWER_ARM_R_LIMIT_Pin) == GPIO_PIN_RESET)
#define LOWER_ARM_R_LIMIT_OFF !LOWER_ARM_R_LIMIT_ON

#define UPPER_ARM_DEG_UNDER_LIMIT_ON (HAL_GPIO_ReadPin(UPPER_ARM_DEG_UNDER_LIMIT_GPIO_Port, UPPER_ARM_DEG_UNDER_LIMIT_Pin) == GPIO_PIN_RESET)
#define UPPER_ARM_DEG_UNDER_LIMIT_OFF !UPPER_ARM_DEG_UNDER_LIMIT_ON

#define UPPER_ARM_R_LIMIT_ON (HAL_GPIO_ReadPin(UPPER_ARM_R_LIMIT_GPIO_Port, UPPER_ARM_R_LIMIT_Pin) == GPIO_PIN_RESET)
#define UPPER_ARM_R_LIMIT_OFF !UPPER_ARM_R_LIMIT_ON

#define ROBOMAS_ANGLE_RESOLUTION 8192 //0〜8191


/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
CAN_HandleTypeDef hcan1;
CAN_HandleTypeDef hcan2;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
direct_t coordinate[ARM_NUM] = {LOWER_ARM_HOME_COORDINATE, UPPER_ARM_HOME_COORDINATE};
#define coordinate_lower coordinate[0]
#define coordinate_upper coordinate[1]

robomas_t robomas[ROBOMAS_NUM] = {
  {.state = ROBOMAS_INITIAL, .rpm_pid = {
    .p = 10, .i = 0, .d = 0,
  }},
  {.state = ROBOMAS_INITIAL, .rpm_pid = {
    .p = 10, .i = 0, .d = 0,
  }},
  {.state = ROBOMAS_INITIAL, .rpm_pid = {
    .p = 10, .i = 0, .d = 0,
  }},
  {.state = ROBOMAS_INITIAL, .rpm_pid = {
    .p = 10, .i = 0, .d = 0,
  }},
};
#define robomas_lower_r robomas[0]
#define robomas_lower_deg robomas[1]
#define robomas_upper_r robomas[2]
#define robomas_upper_deg robomas[3]
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_CAN1_Init(void);
static void MX_CAN2_Init(void);
static void MX_USART2_UART_Init(void);
/* USER CODE BEGIN PFP */
void command_receive(can_command_data_t *com);
void robomas_receive(uint8_t robomas_id, uint8_t *data);
void pid_reset(pid_t *pid);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef *hcan)
{
  CAN_RxHeaderTypeDef rx_header;
  uint8_t rx_data[8];
  if(HAL_CAN_GetRxMessage(hcan,CAN_RX_FIFO0,&rx_header,rx_data) != HAL_OK)return;
  if (hcan->Instance == COMMAND_CAN) {
    can_command_data_t com = {
      .id = rx_header.StdId,
    };
    memcpy(com.data.raw, rx_data, rx_header.DLC);
    command_receive(&com);
  }else if (hcan->Instance == ROBOMAS_CAN) {
    if (rx_header.IDE != CAN_ID_STD || (rx_header.StdId < 0x201 || rx_header.StdId > 0x204))return;
    uint8_t robomas_id = rx_header.StdId - 0x201; // 201→0, 202→1, 203→2
    robomas_receive(robomas_id, rx_data);
  }
}

void command_receive(can_command_data_t *com){
  switch (com->id) {
  case CAN_ID_LOWER_ARM_COMMAND:
    if(robomas_lower_r.state != ROBOMAS_READY || robomas_lower_deg.state != ROBOMAS_READY)return;
    coordinate_lower.x = com->data.lower_arm.x;
    coordinate_lower.y = com->data.lower_arm.y;
    break;  
  case CAN_ID_UPPER_ARM_COMMAND:
    if(robomas_upper_r.state != ROBOMAS_READY || robomas_upper_deg.state != ROBOMAS_READY)return;
    coordinate_upper.x = com->data.upper_arm.x;
    coordinate_upper.y = com->data.upper_arm.y;
    break;
  case CAN_ID_UPPER_HOMING:
    if(!robomas_upper_deg.feedback.initialized || !robomas_upper_r.feedback.initialized)return;
    if(robomas_upper_r.state == ROBOMAS_IDLE || robomas_upper_deg.state == ROBOMAS_IDLE)return;
    if(robomas_upper_r.state == ROBOMAS_ERROR || robomas_upper_deg.state == ROBOMAS_ERROR){
      stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
        .id = CAN_ID_ERROR_CODE,
        .data.error_code = CAN_ERROR_UPPER_HOMING_REJECTED,
      });
      return;
    }
    //INITAIL -> HOMING or READY -> HOMING
    pid_reset(&robomas_upper_r.rpm_pid);
    pid_reset(&robomas_upper_deg.rpm_pid);
    robomas_upper_r.state = ROBOMAS_HOMING;
    robomas_upper_deg.state = ROBOMAS_HOMING;
    upper_homing_start_time = HAL_GetTick();
    break;
  case CAN_ID_LOWER_HOMING:
    if(!robomas_lower_deg.feedback.initialized || !robomas_lower_r.feedback.initialized)return;
    if(robomas_lower_r.state == ROBOMAS_IDLE || robomas_lower_deg.state == ROBOMAS_IDLE)return;
    if(robomas_lower_r.state == ROBOMAS_ERROR || robomas_lower_deg.state == ROBOMAS_ERROR){
      stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
        .id = CAN_ID_ERROR_CODE,
        .data.error_code = CAN_ERROR_LOWER_HOMING_REJECTED,
      });
      return;
    }
    //INITAIL -> HOMING or READY -> HOMING
    pid_reset(&robomas_lower_r.rpm_pid);
    pid_reset(&robomas_lower_deg.rpm_pid);
    robomas_lower_r.state = ROBOMAS_HOMING;
    robomas_lower_deg.state = ROBOMAS_HOMING;
    lower_homing_start_time = HAL_GetTick();
    break;
  default:
    break;
  }
}

