nyankowan/CatchRobo_2026/STM32/robomas_controller/Core/Src/main.c
void robomas_receive(uint8_t robomas_id, uint8_t *data){
// Robomasterからのフィードバック
  robomas[robomas_id].feedback.angle_raw =   ((uint16_t)data[0] << 8) | data[1];
  robomas[robomas_id].feedback.rpm =         ((int16_t)data[2] << 8) | data[3];
  robomas[robomas_id].feedback.current =     ((int16_t)data[4] << 8) | data[5];
  robomas[robomas_id].feedback.temperature = data[6]; 

  if(!robomas[robomas_id].feedback.initialized){
    robomas[robomas_id].feedback.total_angle = robomas[robomas_id].feedback.angle_raw;
    robomas[robomas_id].feedback.last_angle = robomas[robomas_id].feedback.angle_raw;
    robomas[robomas_id].feedback.initialized = true;
    robomas[robomas_id].feedback.last_update = HAL_GetTick();
    return;
  }

  int16_t delta = robomas[robomas_id].feedback.angle_raw - robomas[robomas_id].feedback.last_angle;

  if (delta > ROBOMAS_ANGLE_RESOLUTION / 2){
      delta -= ROBOMAS_ANGLE_RESOLUTION;
  }else if (delta < -ROBOMAS_ANGLE_RESOLUTION / 2){
      delta += ROBOMAS_ANGLE_RESOLUTION;
  }

  robomas[robomas_id].feedback.total_angle += delta;
  robomas[robomas_id].feedback.last_angle = robomas[robomas_id].feedback.angle_raw;
  robomas[robomas_id].feedback.last_update = HAL_GetTick();
}

void robomas_send_torque(robomas_t rb[]){
  for(int i = 0; i < ROBOMAS_NUM; i++){
    if(rb[i].tx_torque > ROBOMAS_MAX_TORQUE)rb[i].tx_torque = ROBOMAS_MAX_TORQUE;
    if(rb[i].tx_torque < -ROBOMAS_MAX_TORQUE)rb[i].tx_torque = -ROBOMAS_MAX_TORQUE;
  }
  if(0 < HAL_CAN_GetTxMailboxesFreeLevel(&ROBOMAS_HCAN)){
    CAN_TxHeaderTypeDef TxHeader;
    uint32_t TxMailbox;
    uint8_t TxData[8];
    TxHeader.StdId = 0x200;                 // CAN ID
    TxHeader.RTR = CAN_RTR_DATA;            // フレームタイプはデータフレーム
    TxHeader.IDE = CAN_ID_STD;              // 標準ID(11ﾋﾞｯﾄ)
    TxHeader.DLC = 8;                       // データ長は8バイトに
    TxHeader.TransmitGlobalTime = DISABLE;  // ???
    TxData[0] = rb[0].tx_torque >> 8 & 0x00FF;
    TxData[1] = rb[0].tx_torque & 0x00FF;
    TxData[2] = rb[1].tx_torque >> 8 & 0x00FF;
    TxData[3] = rb[1].tx_torque & 0x00FF;
    TxData[4] = rb[2].tx_torque >> 8 & 0x00FF;
    TxData[5] = rb[2].tx_torque & 0x00FF;
    TxData[6] = rb[3].tx_torque >> 8 & 0x00FF;
    TxData[7] = rb[3].tx_torque & 0x00FF;   
    HAL_CAN_AddTxMessage(&ROBOMAS_HCAN, &TxHeader, TxData, &TxMailbox);
  }
}
/**
* @brief 目標値sp,制御量pvに基づいてpid式で操作量mvを計算し，結果をmvに格納する
* @return 操作量を返す
  double p;   //比例ゲイン
  double i;   //積分ゲイン
  double d;   //微分ゲイン
  double mv;  //manipulated value 操作量
  double sv;  //set value 目標値
  double it;  //integral term 積分項 偏差の総和
  double pe;  //previous error 直前の偏差
  double pv;  //process value 制御量 フィードバック
*/
double calc_pid(pid_t *pid){
  uint32_t now = HAL_GetTick();
  if(now == pid->last_update)return pid->mv;
  double delta_sec = (now - pid->last_update)/1000.0;
  double e =  pid->sv - pid->pv; //erro 偏差
  double dt = (e - pid->pe)/delta_sec; //derivative term 微分項
  pid->it += e * delta_sec;
  pid->mv = pid->p * e + pid->i * pid->it + pid->d * dt;
  pid->pe = e;
  pid->last_update = now;
  return pid->mv;
}

/**
* @brief 積分項，直前の偏差，操作量をリセット．last_updateも更新する．
*/
void pid_reset(pid_t *pid){
    pid->it = 0.0;
    pid->pe = 0.0;
    pid->mv = 0.0;
    pid->last_update = HAL_GetTick();
}

/*in main roop begin*/
void upper_homing(){
  if(robomas_upper_r.state == ROBOMAS_READY && robomas_upper_deg.state == ROBOMAS_READY)return;

  if((robomas_upper_deg.state != ROBOMAS_INITIAL || robomas_upper_r.state != ROBOMAS_INITIAL) &&
     HAL_GetTick() - upper_homing_start_time > HOMING_UPPER_ARM_TIMEOUT_MS){
    robomas_upper_deg.state = ROBOMAS_INITIAL;
    robomas_upper_r.state = ROBOMAS_INITIAL;

    stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
      .id = CAN_ID_ERROR_CODE,
      .data.error_code = CAN_ERROR_UPPER_HOMING_TIMEOUT,
    });
  }

  if(robomas_upper_deg.state == ROBOMAS_HOMING && UPPER_ARM_DEG_UNDER_LIMIT_ON){
    robomas_upper_deg.state = ROBOMAS_IDLE;
    robomas_upper_deg.total_angle_home = robomas_upper_deg.feedback.total_angle;
    pid_reset(&robomas_upper_deg.rpm_pid);
  }
    
  if(robomas_upper_r.state == ROBOMAS_HOMING && UPPER_ARM_R_LIMIT_ON){
    robomas_upper_r.state = ROBOMAS_IDLE;
    robomas_upper_r.total_angle_home = robomas_upper_r.feedback.total_angle - ARM_R_ROBOMAS_DIRECTION * UPPER_ARM_R_MIN / (R_ROBOMAS_DIAMETER * M_PI) * ROBOMAS_ANGLE_RESOLUTION;
    pid_reset(&robomas_upper_r.rpm_pid);
  }

  if(robomas_upper_r.state == ROBOMAS_IDLE && robomas_upper_deg.state == ROBOMAS_IDLE){
    pid_reset(&robomas_upper_r.ang_pid);
    pid_reset(&robomas_upper_deg.ang_pid);
    
    robomas_upper_r.state = ROBOMAS_READY;
    robomas_upper_deg.state = ROBOMAS_READY;

    stm_can_send(&COMMAND_HCAN, &(can_command_data_t){.id = CAN_ID_UPPER_HOMING_DONE});
    return;
  }
}

void lower_homing(){
  if(robomas_lower_r.state == ROBOMAS_READY && robomas_lower_deg.state == ROBOMAS_READY)return;
  if((robomas_lower_deg.state != ROBOMAS_INITIAL || robomas_lower_r.state != ROBOMAS_INITIAL) &&
     HAL_GetTick() - lower_homing_start_time > HOMING_LOWER_ARM_TIMEOUT_MS){
    robomas_lower_deg.state = ROBOMAS_INITIAL;
    robomas_lower_r.state = ROBOMAS_INITIAL;

    stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
      .id = CAN_ID_ERROR_CODE,
      .data.error_code = CAN_ERROR_LOWER_HOMING_TIMEOUT,
    });
  }

  if(robomas_lower_deg.state == ROBOMAS_HOMING && LOWER_ARM_DEG_UNDER_LIMIT_ON){
    robomas_lower_deg.state = ROBOMAS_IDLE;
    robomas_lower_deg.total_angle_home = robomas_lower_deg.feedback.total_angle;
    pid_reset(&robomas_lower_deg.rpm_pid);
  }
    
  if(robomas_lower_r.state == ROBOMAS_HOMING && LOWER_ARM_R_LIMIT_ON){
    robomas_lower_r.state = ROBOMAS_IDLE;
    robomas_lower_r.total_angle_home = robomas_lower_r.feedback.total_angle  - ARM_R_ROBOMAS_DIRECTION * LOWER_ARM_R_MIN / (R_ROBOMAS_DIAMETER * M_PI) * ROBOMAS_ANGLE_RESOLUTION;
    pid_reset(&robomas_lower_r.rpm_pid);
  }

  if(robomas_lower_r.state == ROBOMAS_IDLE && robomas_lower_deg.state == ROBOMAS_IDLE){
    pid_reset(&robomas_lower_r.ang_pid);
    pid_reset(&robomas_lower_deg.ang_pid);
    
    robomas_lower_r.state = ROBOMAS_READY;
    robomas_lower_deg.state = ROBOMAS_READY;
    stm_can_send(&COMMAND_HCAN, &(can_command_data_t){.id = CAN_ID_LOWER_HOMING_DONE});
    return;
  }
}

double get_r(robomas_t *rb)
{
    double motor_angle =
        rb->feedback.total_angle - rb->total_angle_home;

    return ARM_R_ROBOMAS_DIRECTION
     * motor_angle
     / ROBOMAS_ANGLE_RESOLUTION
     * (R_ROBOMAS_DIAMETER * M_PI);
}

/**
* @brief ホーミングrpmを目標値svにセットする．
* @return 正常なら引数を返す．異常ならNULL． 
*/
robomas_t *set_robomas_homing_rpm(robomas_t *rb){
  if(rb == &robomas_lower_deg){
    rb->rpm_pid.sv = -ARM_DEG_ROBOMAS_DIRECTION * HOMING_LOWER_DEG_RPM;
  }else if(rb == &robomas_upper_deg){
    rb->rpm_pid.sv = -ARM_DEG_ROBOMAS_DIRECTION * HOMING_UPPER_DEG_RPM;
  }else if(rb == &robomas_lower_r){
    rb->rpm_pid.sv = -ARM_R_ROBOMAS_DIRECTION * HOMING_LOWER_R_RPM;
  }else if(rb == &robomas_upper_r){
    rb->rpm_pid.sv = -ARM_R_ROBOMAS_DIRECTION * HOMING_UPPER_R_RPM;
  }else{return NULL;}
  return rb;
}
/**
* @brief 座標に対応するロボマスの角度(一周あたり8192)を座標から計算し，角度目標値svにセットする．
* @return 正常なら引数を返す．異常ならNULL． 
**/
robomas_t *set_robomas_deg_from_coordinate(robomas_t *rb){
  if(rb == &robomas_lower_deg){
    rb->ang_pid.sv = ARM_DEG_ROBOMAS_DIRECTION * to_polar(coordinate_lower).theta / (2 * M_PI) * POLAR_RATIO * ROBOMAS_ANGLE_RESOLUTION;
  }else if(rb == &robomas_lower_r){
    rb->ang_pid.sv = ARM_R_ROBOMAS_DIRECTION * to_polar(coordinate_lower).r /(R_ROBOMAS_DIAMETER * M_PI) * ROBOMAS_ANGLE_RESOLUTION;
  }else if(rb == &robomas_upper_deg){
    rb->ang_pid.sv = ARM_DEG_ROBOMAS_DIRECTION * to_polar(coordinate_upper).theta / (2 * M_PI) * POLAR_RATIO * ROBOMAS_ANGLE_RESOLUTION;
  }else if(rb == &robomas_upper_r){
    rb->ang_pid.sv = ARM_R_ROBOMAS_DIRECTION * to_polar(coordinate_upper).r /(R_ROBOMAS_DIAMETER * M_PI) * ROBOMAS_ANGLE_RESOLUTION;
  }else{return NULL;}
  return rb;
}

/**
* @brief フィードバック途絶によりROBOMAS_ERRORへ遷移した軸を特定するエラーコードを返す．
*/
can_error_t get_lost_control_error_code(robomas_t *rb){
  if(rb == &robomas_lower_r)        return CAN_ERROR_LOWER_R_LOST_CONTROL;
  else if(rb == &robomas_lower_deg) return CAN_ERROR_LOWER_DEG_LOST_CONTROL;
  else if(rb == &robomas_upper_r)   return CAN_ERROR_UPPER_R_LOST_CONTROL;
  else                              return CAN_ERROR_UPPER_DEG_LOST_CONTROL;
}

